app/controllers/biometrics_controller.rb

  def index
  @biometrics = Biometric.all
---
SELECT "biometrics".* FROM "biometrics"

def show
  @biometric = Biometric.find(params[:id])
---
SELECT  "biometrics".* FROM "biometrics" WHERE "biometrics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def edit
  @biometrics = Biometric.find(params[:id])
---
SELECT  "biometrics".* FROM "biometrics" WHERE "biometrics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]